### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_profile must be replaced
-/+ resource "aws_iam_instance_profile" "ec2_profile" {
!       arn         = "arn:aws:iam::702865854817:instance-profile/test_profile" -> (known after apply)
!       create_date = "2025-07-14T15:13:28Z" -> (known after apply)
!       id          = "test_profile" -> (known after apply)
!       name        = "test_profile" -> "asmita-test_profile" # forces replacement
+       name_prefix = (known after apply)
!       role        = "asmita-ec2_role" -> "ec2_role"
      - tags        = {} -> null
!       tags_all    = {} -> (known after apply)
!       unique_id   = "AIPA2HJQR2FQZZO6I5A22" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.ec2_role must be replaced
-/+ resource "aws_iam_role" "ec2_role" {
!       arn                   = "arn:aws:iam::702865854817:role/asmita-ec2_role" -> (known after apply)
!       create_date           = "2025-07-14T15:13:27Z" -> (known after apply)
!       id                    = "asmita-ec2_role" -> (known after apply)
!       managed_policy_arns   = [] -> (known after apply)
!       name                  = "asmita-ec2_role" -> "ec2_role" # forces replacement
+       name_prefix           = (known after apply)
        tags                  = {
            "tag-key" = "tag-value"
        }
!       unique_id             = "AROA2HJQR2FQ6KNOEBPIP" -> (known after apply)
        # (7 unchanged attributes hidden)

!       inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_policy will be created
+   resource "aws_iam_role_policy_attachment" "attach_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::702865854817:policy/this"
+       role       = "ec2_role"
    }

  # aws_instance.asmita_ec2 must be replaced
-/+ resource "aws_instance" "asmita_ec2" {
!       arn                                  = "arn:aws:ec2:us-east-1:702865854817:instance/i-067aa675b16b28b04" -> (known after apply)
!       associate_public_ip_address          = false -> true # forces replacement
!       availability_zone                    = "us-east-1c" -> (known after apply)
!       disable_api_stop                     = false -> (known after apply)
!       disable_api_termination              = false -> (known after apply)
!       ebs_optimized                        = false -> (known after apply)
+       enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
!       iam_instance_profile                 = "test_profile" -> "asmita-test_profile"
!       id                                   = "i-067aa675b16b28b04" -> (known after apply)
!       instance_initiated_shutdown_behavior = "stop" -> (known after apply)
+       instance_lifecycle                   = (known after apply)
!       instance_state                       = "stopped" -> (known after apply)
!       ipv6_address_count                   = 0 -> (known after apply)
!       ipv6_addresses                       = [] -> (known after apply)
+       key_name                             = (known after apply)
!       monitoring                           = false -> (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
!       placement_partition_number           = 0 -> (known after apply)
!       primary_network_interface_id         = "eni-04882a6eebb8aca86" -> (known after apply)
!       private_dns                          = "ip-172-31-89-75.ec2.internal" -> (known after apply)
!       private_ip                           = "172.31.89.75" -> (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
!       secondary_private_ips                = [] -> (known after apply)
!       security_groups                      = [
          - "default",
        ] -> (known after apply)
+       spot_instance_request_id             = (known after apply)
!       subnet_id                            = "subnet-023c2cd410e480bdd" -> (known after apply)
        tags                                 = {
            "Creator" = "asmita gupta"
            "Name"    = "my-server-asmita"
        }
!       tenancy                              = "default" -> (known after apply)
+       user_data_base64                     = (known after apply)
!       vpc_security_group_ids               = [
          - "sg-0d4fa51ba41dfa1b5",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

!       capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

!       cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

!       ebs_block_device (known after apply)

!       enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

!       ephemeral_block_device (known after apply)

!       instance_market_options (known after apply)

!       maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

!       metadata_options {
!           http_put_response_hop_limit = 2 -> (known after apply)
!           instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

!       network_interface (known after apply)

!       private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

!       root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0778161de213dc7e8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```
</details>